app/controllers/books_controller.rb

INSERT INTO "books" ("bname", "bwriter", "bprise", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["bname", "DJ "], ["bwriter", "Venky"], ["bprise", 2000000], ["created_at", "2019-06-14 06:22:30.122216"], ["updated_at", "2019-06-14 06:22:30.122216"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "bname" = ?, "bwriter" = ?, "bprise" = ?, "description" = ?, "No_of_pages" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["bname", "Justice"], ["bwriter", "Mohan llb"], ["bprise", 390], ["description", "A life story"], ["No_of_pages", 320], ["updated_at", "2019-06-15 10:21:25.339564"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)